In [1]:
import pandas as pd
import numpy as np

Importando Banco de Dados

In [2]:
df = pd.read_csv('train.csv', index_col='id')

In [3]:
df.head()

    age          job   marital  ... euribor3m nr.employed   y
id                              ...
0    52   technician  divorced  ...     4.865      5228.1  no
1    36   management   married  ...     4.153      5195.8  no
2    53  blue-collar   married  ...     4.962      5228.1  no
3    45  blue-collar    single  ...     0.879      5076.2  no
4    60    housemaid   married  ...     4.858      5191.0  no

[5 rows x 21 columns]

In [4]:
for c in df.columns[df.dtypes == object]:
    df[c] = df[c].astype('category')

In [5]:
df.education.cat.reorder_categories(['illiterate', 'basic.4y', 'basic.6y', 'basic.9y', 'high.school', 
       'professional.course', 'university.degree'], ordered=True, inplace=True)

In [6]:
for c in df.columns[df.dtypes == 'category']:
    df[c] = df[c].cat.codes

In [7]:
df.head()

    age  job  marital  education  ...  cons.conf.idx  euribor3m  nr.employed  y
id                                ...
0    52    9        0          5  ...          -41.8      4.865       5228.1  0
1    36    4        1          6  ...          -42.0      4.153       5195.8  0
2    53    1        1          4  ...          -42.7      4.962       5228.1  0
3    45    1        2          3  ...          -31.4      0.879       5076.2  0
4    60    3        1          4  ...          -36.4      4.858       5191.0  0

[5 rows x 21 columns]

In [8]:
#previsores = df.drop(['default','contact', 'duration', 'previous', 'campaign', 'pdays', 'y'],  axis=1)
previsores = df.drop(['y'],  axis=1)
previsores.head()

    age  job  marital  ...  cons.conf.idx  euribor3m  nr.employed
id                     ...
0    52    9        0  ...          -41.8      4.865       5228.1
1    36    4        1  ...          -42.0      4.153       5195.8
2    53    1        1  ...          -42.7      4.962       5228.1
3    45    1        2  ...          -31.4      0.879       5076.2
4    60    3        1  ...          -36.4      4.858       5191.0

[5 rows x 20 columns]

In [9]:
classe = df.filter('y')
classe.head()

    y
id
0   0
1   0
2   0
3   0
4   0

In [10]:
sum(classe['y'])

4176

In [11]:
#from sklearn.preprocessing import StandardScaler
#scaler = StandardScaler()
#previsores = scaler.fit_transform(previsores)
#classe = scaler.fit_transform(classe)

In [12]:
from sklearn.model_selection import train_test_split
previsores_treinamento, previsores_teste, classe_treinamento, classe_teste = train_test_split(previsores, classe, test_size=0.15, random_state=42, shuffle=True, stratify=classe)

In [13]:
previsores_treinamento.shape, previsores_teste.shape, classe_treinamento.shape, classe_teste.shape

((31508, 20), (5561, 20), (31508, 1), (5561, 1))

In [14]:
from sklearn.neighbors import KNeighborsClassifier
knn_class = KNeighborsClassifier()
knn_class.fit(previsores_treinamento, classe_treinamento)

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:3: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  This is separate from the ipykernel package so we can avoid doing imports until

KNeighborsClassifier(algorithm='auto', leaf_size=30, metric='minkowski',
                     metric_params=None, n_jobs=None, n_neighbors=5, p=2,
                     weights='uniform')

In [15]:
knn_class.score(previsores_treinamento, classe_treinamento)

0.9306207947188015

In [16]:
y_pred = knn_class.predict(previsores_teste)

In [17]:
from sklearn import metrics
print(metrics.classification_report(classe_teste, y_pred))

              precision    recall  f1-score   support

           0       0.93      0.96      0.95      4935
           1       0.60      0.46      0.52       626

    accuracy                           0.90      5561
   macro avg       0.77      0.71      0.74      5561
weighted avg       0.90      0.90      0.90      5561

In [18]:
sum(y_pred)

485

Kadle

In [47]:
aval = pd.read_csv('test.csv', index_col='id')
sub = pd.read_csv('sample.csv', index_col='id')

In [48]:
aval.head()

    age          job  marital  ... cons.conf.idx euribor3m nr.employed
id                             ...
0    49  blue-collar  married  ...         -41.8     4.959      5228.1
1    23      student   single  ...         -47.1     1.405      5099.1
2    42   technician  married  ...         -38.3     0.899      4991.6
3    51  blue-collar  married  ...         -46.2     1.334      5099.1
4    32   technician  married  ...         -37.5     0.878      4963.6

[5 rows x 20 columns]

In [49]:
for c in aval.columns[aval.dtypes == object]:
    aval[c] = aval[c].astype('category')
aval.education.cat.reorder_categories(['illiterate', 'basic.4y', 'basic.6y', 'basic.9y', 'high.school', 
       'professional.course', 'university.degree'], ordered=True, inplace=True)
for c in aval.columns[aval.dtypes == 'category']:
    aval[c] = aval[c].cat.codes

In [50]:
aval.head()

    age  job  marital  ...  cons.conf.idx  euribor3m  nr.employed
id                     ...
0    49    1        1  ...          -41.8      4.959       5228.1
1    23    8        2  ...          -47.1      1.405       5099.1
2    42    9        1  ...          -38.3      0.899       4991.6
3    51    1        1  ...          -46.2      1.334       5099.1
4    32    9        1  ...          -37.5      0.878       4963.6

[5 rows x 20 columns]

In [39]:
#previsores = aval.drop(['contact', 'duration', 'previous'],  axis=1)

In [40]:
#aval = scaler.fit_transform(aval)

In [51]:
y_aval = knn_class.predict(aval)

In [52]:
sub.y = pd.Series(y_aval)

In [53]:
sub.head()

    y
id
0   0
1   0
2   1
3   0
4   0

In [54]:
sub.to_csv('Resultado_lucas_KNN.csv')